luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxInt_regdef.h
/** \brief  OTGM IRQ MUX Select 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OIXS0_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OIXS0;

/** \brief  OTGM IRQ MUX Select 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OIXS1_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OIXS1;

/** \brief  OTGM IRQ MUX Trigger Set Select */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OIXTS_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OIXTS;

/** \brief  OTGM MCDS I/F Sensitivity Negedge */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OMISN_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OMISN;

/** \brief  OTGM MCDS I/F Sensitivity Posedge */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OMISP_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OMISP;

/** \brief  OTGM OTGB0/1 Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OOBS_Bits B;                    /**< \brief Bitfield access */
} Ifx_INT_OOBS;

/** \brief  OTGM SSI Control */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_OSSIC_Bits B;                   /**< \brief Bitfield access */
} Ifx_INT_OSSIC;

/** \brief  Service Request Broadcast Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_INT_SRB_Bits B;                     /**< \brief Bitfield access */
} Ifx_INT_SRB;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Int_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  Interrupt router channel */
typedef volatile struct _Ifx_INT_ICU
{
    Ifx_INT_ICU_LWSR LWSR;                  /**< \brief 0, Latest Winning Service Request Register */
    Ifx_INT_ICU_LASR LASR;                  /**< \brief 4, Last Acknowledged Service Request Register */
    Ifx_INT_ICU_ECR ECR;                    /**< \brief 8, Error Capture Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
} Ifx_INT_ICU;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Int_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  Interrupt router object */
typedef volatile struct _Ifx_INT
{
    unsigned char reserved_0[8];            /**< \brief 0, \internal Reserved */
    Ifx_INT_ID ID;                          /**< \brief 8, Module Identification Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_INT_SRB SRB0;                       /**< \brief 10, Service Request Broadcast Register 0 */
    Ifx_INT_SRB SRB1;                       /**< \brief 14, Service Request Broadcast Register 1 */
    Ifx_INT_SRB SRB2;                       /**< \brief 18, Service Request Broadcast Register 2 */
    unsigned char reserved_1C[100];         /**< \brief 1C, \internal Reserved */
    Ifx_INT_OOBS OOBS;                      /**< \brief 80, OTGM OTGB0/1 Status */
    Ifx_INT_OSSIC OSSIC;                    /**< \brief 84, OTGM SSI Control */
    Ifx_INT_OIXTS OIXTS;                    /**< \brief 88, OTGM IRQ MUX Trigger Set Select */
    Ifx_INT_OIXMS OIXMS;                    /**< \brief 8C, OTGM IRQ MUX Missed IRQ Select */
    Ifx_INT_OIXS0 OIXS0;                    /**< \brief 90, OTGM IRQ MUX Select 0 */
    Ifx_INT_OIXS1 OIXS1;                    /**< \brief 94, OTGM IRQ MUX Select 1 */
    unsigned char reserved_98[8];           /**< \brief 98, \internal Reserved */
    Ifx_INT_OIT OIT;                        /**< \brief A0, OTGM IRQ Trace */
    Ifx_INT_OMISP OMISP;                    /**< \brief A4, OTGM MCDS I/F Sensitivity Posedge */
    Ifx_INT_OMISN OMISN;                    /**< \brief A8, OTGM MCDS I/F Sensitivity Negedge */
    unsigned char reserved_AC[68];          /**< \brief AC, \internal Reserved */
    Ifx_INT_ACCEN01 ACCEN01;                /**< \brief F0, Kernel 0 Access Enable Register 1 */
    Ifx_INT_ACCEN00 ACCEN00;                /**< \brief F4, Access Enable Register 0 */
    Ifx_INT_ACCEN11 ACCEN11;                /**< \brief F8, Kernel 1 Access Enable Register 1 */
    Ifx_INT_ACCEN10 ACCEN10;                /**< \brief FC, Kernel 1 Access Enable Register 0 */
    Ifx_INT_ICU CH[4];                      /**< \brief 100, Interrupt router channel */
    unsigned char reserved_140[3776];       /**< \brief 140, \internal Reserved */
} Ifx_INT;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXINT_REGDEF_H */
